export const TAROT_CARDS_WAITES = {
  major_arcana: [
    "Шут (0)",
    "Маг (1)",
    "Верховная Жрица (2)",
    "Императрица (3)",
    "Император (4)",
    "Иерофант (5)",
    "Влюбленные (6)",
    "Колесница (7)",
    "Сила (8)",
    "Отшельник (9)",
    "Колесо Фортуны (10)",
    "Справедливость (11)",
    "Повешенный (12)",
    "Смерть (13)",
    "Умеренность (14)",
    "Дьявол (15)",
    "Башня (16)",
    "Звезда (17)",
    "Луна (18)",
    "Солнце (19)",
    "Суд (20)",
    "Мир (21)"
  ],
  minor_arcana: {
    wands: [
      "Туз Жезлов",
      "Двойка Жезлов",
      "Тройка Жезлов",
      "Четверка Жезлов",
      "Пятерка Жезлов",
      "Шестерка Жезлов",
      "Семерка Жезлов",
      "Восьмерка Жезлов",
      "Девятка Жезлов",
      "Десятка Жезлов",
      "Паж Жезлов",
      "Рыцарь Жезлов",
      "Королева Жезлов",
      "Король Жезлов"
    ],
    cups: [
      "Туз Кубков",
      "Двойка Кубков",
      "Тройка Кубков",
      "Четверка Кубков",
      "Пятерка Кубков",
      "Шестерка Кубков",
      "Семерка Кубков",
      "Восьмерка Кубков",
      "Девятка Кубков",
      "Десятка Кубков",
      "Паж Кубков",
      "Рыцарь Кубков",
      "Королева Кубков",
      "Король Кубков"
    ],
    swords: [
      "Туз Мечей",
      "Двойка Мечей",
      "Тройка Мечей",
      "Четверка Мечей",
      "Пятерка Мечей",
      "Шестерка Мечей",
      "Семерка Мечей",
      "Восьмерка Мечей",
      "Девятка Мечей",
      "Десятка Мечей",
      "Паж Мечей",
      "Рыцарь Мечей",
      "Королева Мечей",
      "Король Мечей"
    ],
    pentacles: [
      "Туз Пентаклей",
      "Двойка Пентаклей",
      "Тройка Пентаклей",
      "Четверка Пентаклей",
      "Пятерка Пентаклей",
      "Шестерка Пентаклей",
      "Семерка Пентаклей",
      "Восьмерка Пентаклей",
      "Девятка Пентаклей",
      "Десятка Пентаклей",
      "Паж Пентаклей",
      "Рыцарь Пентаклей",
      "Королева Пентаклей",
      "Король Пентаклей"
    ]
  }
};

export const RWS_ALL: string[] = [
  ...TAROT_CARDS_WAITES.major_arcana,
  ...Object.values(TAROT_CARDS_WAITES.minor_arcana).flat()
];
